---
title: SolidOrShellTessellationControls
classe: Autodesk.Revit.DB.SolidOrShellTessellationControls
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# SolidOrShellTessellationControls

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Accuracy { get; set; }` | `solidOrShellTessellationControls.Accuracy` | Double |
| `Boolean IsValidObject { get; }` | `solidOrShellTessellationControls.IsValidObject` | Boolean |
| `Double LevelOfDetail { get; set; }` | `solidOrShellTessellationControls.LevelOfDetail` | Double |
| `Double MinAngleInTriangle { get; set; }` | `solidOrShellTessellationControls.MinAngleInTriangle` | Double |
| `Double MinExternalAngleBetweenTriangles { get; set; }` | `solidOrShellTessellationControls.MinExternalAngleBetweenTriangles` | Double |
| `Void DisableLevelOfDetail()` | `solidOrShellTessellationControls.DisableLevelOfDetail()` | Void |
| `Void Dispose()` | `solidOrShellTessellationControls.Dispose()` | Void |
| `Boolean UseLevelOfDetail()` | `solidOrShellTessellationControls.UseLevelOfDetail()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```